zuyih/STM32CubeU3/Projects/NUCLEO-U385RG-Q/Applications/ROT/OEMiROT_Boot/Src/low_level_security.c
/**
  ******************************************************************************
  * @file    low_level_security.c
  * @author  MCD Application Team
  * @brief   security protection implementation for secure boot
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include "boot_hal_cfg.h"
#include "boot_hal_flowcontrol.h"
#include "mpu_armv8m_drv.h"
#include "region_defs.h"
#include "mcuboot_config/mcuboot_config.h"
#include "low_level_security.h"
#ifdef OEMIROT_DEV_MODE
#define BOOT_LOG_LEVEL BOOT_LOG_LEVEL_INFO
#else
#define BOOT_LOG_LEVEL BOOT_LOG_LEVEL_OFF
#endif /* OEMIROT_DEV_MODE  */
#include "bootutil/bootutil_log.h"
#if (OEMIROT_TAMPER_ENABLE != NO_TAMPER)
#include "low_level_rng.h"
#endif /*  (OEMIROT_TAMPER_ENABLE != NO_TAMPER)*/
#include "target_cfg.h"
#include "bootutil_priv.h"

/** @defgroup OEMIROT_SECURITY_Private_Defines  Private Defines
  * @{
  */
/* DUAL BANK page size */
#define PAGE_SIZE FLASH_AREA_IMAGE_SECTOR_SIZE

#define BANK_NUMBER 2
#if defined(STM32U335xx) || defined(STM32U345xx)
#define PAGE_MAX_NUMBER_IN_BANK 31
#elif defined(STM32U385xx) || defined(STM32U375xx)
#define PAGE_MAX_NUMBER_IN_BANK 127
#elif defined (STM32U395xx) || defined (STM32U399xx) \
   || defined (STM32U3A5xx) || defined (STM32U3A9xx) \
   || defined (STM32U3F9xx) || defined (STM32U3G9xx) \
   || defined (STM32U3G7xx)
#define PAGE_MAX_NUMBER_IN_BANK 255
#endif


/* OEMiROT_Boot Vector Address  */
#define OEMIROT_BOOT_VTOR_ADDR ((uint32_t)(BL2_CODE_START))

uint32_t start;
uint32_t end;
const struct mpu_armv8m_region_cfg_t region_cfg_init_s[] =
{
  /* Region 0: Allows execution of BL2 (OEMiROT Boot) */
  {
    0,
    FLASH_BASE_S + FLASH_AREA_BL2_OFFSET,
    FLASH_BASE_S + FLASH_AREA_BL2_OFFSET + FLASH_AREA_BL2_SIZE - 1,
    MPU_ARMV8M_MAIR_ATTR_CODE_IDX,
    MPU_ARMV8M_XN_EXEC_OK,
    MPU_ARMV8M_AP_RW_PRIV_ONLY,
    MPU_ARMV8M_SH_NONE,
#ifdef FLOW_CONTROL
    FLOW_STEP_MPU_S_I_EN_R0,
    FLOW_CTRL_MPU_S_I_EN_R0,
    FLOW_STEP_MPU_S_I_CH_R0,
    FLOW_CTRL_MPU_S_I_CH_R0,
#endif /* FLOW_CONTROL */
  },
  /* Region 1: Allows RW access for HASH REF - NVCNT - SCRATCH area's */
  {
    1,
    FLASH_BASE_S,
    FLASH_BASE_S + FLASH_AREA_PERSO_OFFSET - 1,
    MPU_ARMV8M_MAIR_ATTR_DATANOCACHE_IDX,
    MPU_ARMV8M_XN_EXEC_NEVER,
    MPU_ARMV8M_AP_RW_PRIV_ONLY,
    MPU_ARMV8M_SH_NONE,
#ifdef FLOW_CONTROL
    FLOW_STEP_MPU_S_I_EN_R1,
    FLOW_CTRL_MPU_S_I_EN_R1,
    FLOW_STEP_MPU_S_I_CH_R1,
    FLOW_CTRL_MPU_S_I_CH_R1,
#endif /* FLOW_CONTROL */
  },
  /* Region 2 : Allows RW access to all secure PRIMARY SLOTS areas */
  {
    2,
    FLASH_BASE_S + FLASH_AREA_BEGIN_OFFSET,
    FLASH_BASE_S + FLASH_AREA_BEGIN_OFFSET + FLASH_S_DATA_PARTITION_SIZE + FLASH_S_PARTITION_SIZE - 1,
    MPU_ARMV8M_MAIR_ATTR_DATANOCACHE_IDX,
    MPU_ARMV8M_XN_EXEC_NEVER,
    MPU_ARMV8M_AP_RW_PRIV_ONLY,
    MPU_ARMV8M_SH_NONE,
#ifdef FLOW_CONTROL
    FLOW_STEP_MPU_S_I_EN_R2,
    FLOW_CTRL_MPU_S_I_EN_R2,
    FLOW_STEP_MPU_S_I_CH_R2,
    FLOW_CTRL_MPU_S_I_CH_R2,
#endif /* FLOW_CONTROL */
  },
  /* Region 3 : Allows RO access to PERSO DATA area */
  {
    3,
    FLASH_BASE_S + FLASH_AREA_PERSO_OFFSET,
    FLASH_BASE_S + FLASH_AREA_PERSO_OFFSET + FLASH_AREA_PERSO_SIZE - 1,
    MPU_ARMV8M_MAIR_ATTR_DATANOCACHE_IDX,
    MPU_ARMV8M_XN_EXEC_NEVER,
    MPU_ARMV8M_AP_RW_PRIV_ONLY,
    MPU_ARMV8M_SH_NONE,
#ifdef FLOW_CONTROL
    FLOW_STEP_MPU_S_I_EN_R3,
    FLOW_CTRL_MPU_S_I_EN_R3,
    FLOW_STEP_MPU_S_I_CH_R3,
    FLOW_CTRL_MPU_S_I_CH_R3,
#endif /* FLOW_CONTROL */
  },
  /* Region 4: RW/PRIV_ONLY/EXEC_NEVER Forbid execution on full SRAM's area */
  {
    4,
    BL2_DATA_START,
    BL2_DATA_START + BL2_DATA_SIZE - 1,
    MPU_ARMV8M_MAIR_ATTR_DATA_IDX,
    MPU_ARMV8M_XN_EXEC_NEVER,
    MPU_ARMV8M_AP_RW_PRIV_ONLY,
    MPU_ARMV8M_SH_NONE,
#ifdef FLOW_CONTROL
    FLOW_STEP_MPU_S_I_EN_R4,
    FLOW_CTRL_MPU_S_I_EN_R4,
    FLOW_STEP_MPU_S_I_CH_R4,
    FLOW_CTRL_MPU_S_I_CH_R4,
#endif /* FLOW_CONTROL */
  },
  /* Region 5: Allows RW access to peripherals */
  {
    5,
    PERIPH_BASE_NS,
    PERIPH_BASE_S + 0xFFFFFFF,
    MPU_ARMV8M_MAIR_ATTR_DEVICE_IDX,
    MPU_ARMV8M_XN_EXEC_NEVER,
    MPU_ARMV8M_AP_RW_PRIV_ONLY,
    MPU_ARMV8M_SH_NONE,
#ifdef FLOW_CONTROL
    FLOW_STEP_MPU_S_I_EN_R5,
    FLOW_CTRL_MPU_S_I_EN_R5,
    FLOW_STEP_MPU_S_I_CH_R5,
    FLOW_CTRL_MPU_S_I_CH_R5,
#endif /* FLOW_CONTROL */
  },
  /* Region 6: Allows execution of RSSLIB */
  {
    6,
    RSS_LIB_BASE,
    RSS_LIB_BASE + RSS_LIB_SIZE - 1,
    MPU_ARMV8M_MAIR_ATTR_CODE_IDX,
    MPU_ARMV8M_XN_EXEC_OK,
    MPU_ARMV8M_AP_RO_PRIV_ONLY,
    MPU_ARMV8M_SH_NONE,
#ifdef FLOW_CONTROL
    FLOW_STEP_MPU_S_I_EN_R6,
    FLOW_CTRL_MPU_S_I_EN_R6,
    FLOW_STEP_MPU_S_I_CH_R6,
    FLOW_CTRL_MPU_S_I_CH_R6,
#endif /* FLOW_CONTROL */
  },
  /* Region 7: Allows read access to STM32 descriptors */
  /* start = the start of the new descriptor address and the
     end = the end of the old descriptor address */
  {
    7,
    STM32_DESCRIPTOR_BASE_NS,
    STM32_DESCRIPTOR_END_NS,
    MPU_ARMV8M_MAIR_ATTR_DATANOCACHE_IDX,
    MPU_ARMV8M_XN_EXEC_NEVER,
    MPU_ARMV8M_AP_RO_PRIV_ONLY,
    MPU_ARMV8M_SH_NONE,
#ifdef FLOW_CONTROL
    FLOW_STEP_MPU_S_I_EN_R7,
    FLOW_CTRL_MPU_S_I_EN_R7,
    FLOW_STEP_MPU_S_I_CH_R7,
    FLOW_CTRL_MPU_S_I_CH_R7,
#endif /* FLOW_CONTROL */
  },
  /* Region 8: Allows RW access to all Non Secure SLOTS areas */
  /* Secure HAL flash driver uses non secure flash address to perform access to non secure flash area */
  {
    8,
    FLASH_BASE_NS + NS_IMAGE_PRIMARY_PARTITION_OFFSET,
    FLASH_BASE_NS + FLASH_AREA_END_OFFSET - 1,
    MPU_ARMV8M_MAIR_ATTR_DATANOCACHE_IDX,
    MPU_ARMV8M_XN_EXEC_NEVER,
    MPU_ARMV8M_AP_RW_PRIV_ONLY,
    MPU_ARMV8M_SH_NONE,
#ifdef FLOW_CONTROL
    FLOW_STEP_MPU_S_I_EN_R8,
    FLOW_CTRL_MPU_S_I_EN_R8,
    FLOW_STEP_MPU_S_I_CH_R8,
    FLOW_CTRL_MPU_S_I_CH_R8,
#endif /* FLOW_CONTROL */
  },
};

const struct mpu_armv8m_region_cfg_t region_cfg_appli_s[] =
{
  /* First region in this list is configured only at this stage, */
  /* the region will be activated later by RSS jump service. Following regions */
  /*  in this list are configured and activated at this stage. */

  /* Region 1 is now enable for execution */
  {
    1,
    FLASH_BASE_S + S_IMAGE_PRIMARY_PARTITION_OFFSET,
    FLASH_BASE_S + S_IMAGE_PRIMARY_PARTITION_OFFSET + FLASH_S_PARTITION_SIZE - 1 - (~MPU_RLAR_LIMIT_Msk + 1),
    MPU_ARMV8M_MAIR_ATTR_DATA_IDX,
    MPU_ARMV8M_XN_EXEC_OK,
    MPU_ARMV8M_AP_RO_PRIV_ONLY,
    MPU_ARMV8M_SH_NONE,
#ifdef FLOW_CONTROL
    FLOW_STEP_MPU_A_EN_R1,
    FLOW_CTRL_MPU_A_EN_R1,
    FLOW_STEP_MPU_A_CH_R1,
    FLOW_CTRL_MPU_A_CH_R1,
#endif /* FLOW_CONTROL */
  },
  /* Region 2: Allows RW access to end of area 0 (code image) for image confirmation (swap mode) */
  {
    2,
    FLASH_BASE_S + S_IMAGE_PRIMARY_PARTITION_OFFSET + FLASH_S_PARTITION_SIZE - (~MPU_RLAR_LIMIT_Msk + 1),
    FLASH_BASE_S + S_IMAGE_PRIMARY_PARTITION_OFFSET + FLASH_S_PARTITION_SIZE - 1,
    MPU_ARMV8M_MAIR_ATTR_DATANOCACHE_IDX,
    MPU_ARMV8M_XN_EXEC_NEVER,
    MPU_ARMV8M_AP_RW_PRIV_ONLY,
    MPU_ARMV8M_SH_NONE,
#ifdef FLOW_CONTROL
    FLOW_STEP_MPU_A_EN_R2,
    FLOW_CTRL_MPU_A_EN_R2,
    FLOW_STEP_MPU_A_CH_R2,
    FLOW_CTRL_MPU_A_CH_R2,
#endif /* FLOW_CONTROL */
  },
#if MCUBOOT_S_DATA_IMAGE_NUMBER == 1
  /* Region 3: Allows RW access to end of area 4 (data image) for image confirmation (swap mode) */
  {
    3,
    FLASH_BASE_S + S_DATA_IMAGE_PRIMARY_PARTITION_OFFSET + FLASH_S_DATA_PARTITION_SIZE - (~MPU_RLAR_LIMIT_Msk + 1),
    FLASH_BASE_S + S_DATA_IMAGE_PRIMARY_PARTITION_OFFSET + FLASH_S_DATA_PARTITION_SIZE - 1,
    MPU_ARMV8M_MAIR_ATTR_DATANOCACHE_IDX,
    MPU_ARMV8M_XN_EXEC_NEVER,
    MPU_ARMV8M_AP_RW_PRIV_ONLY,
    MPU_ARMV8M_SH_NONE,
#ifdef FLOW_CONTROL
    FLOW_STEP_MPU_A_EN_R3,
    FLOW_CTRL_MPU_A_EN_R3,
    FLOW_STEP_MPU_A_CH_R3,
    FLOW_CTRL_MPU_A_CH_R3,
#endif /* FLOW_CONTROL */
  },
#endif /* (MCUBOOT_S_DATA_IMAGE_NUMBER == 1) */
};

const struct sau_cfg_t sau_init_cfg[] =
{
  /* Region 1: Allows non secure access to FLASH peripheral registers used by secure HAL flash driver */
  /*           to perform access to non secure flash area */
  {
    1,
    (uint32_t)FLASH_NS,
    ((uint32_t)FLASH_NS + 0xffff),
    OEMIROT_FALSE,
#ifdef FLOW_CONTROL
    FLOW_STEP_SAU_I_EN_R1,
    FLOW_CTRL_SAU_I_EN_R1,
    FLOW_STEP_SAU_I_CH_R1,
    FLOW_CTRL_SAU_I_CH_R1,
#endif /* FLOW_CONTROL */
  },
  /* Region 2: Allow non secure Flash base access to all Non Secure SLOTS areas */
  {
    2,
    ((uint32_t)FLASH_BASE_NS + NS_IMAGE_PRIMARY_PARTITION_OFFSET),
    ((uint32_t)FLASH_BASE_NS + FLASH_AREA_END_OFFSET - 1),
    OEMIROT_FALSE,
#ifdef FLOW_CONTROL
    FLOW_STEP_SAU_I_EN_R2,
    FLOW_CTRL_SAU_I_EN_R2,
    FLOW_STEP_SAU_I_CH_R2,
    FLOW_CTRL_SAU_I_CH_R2,
#endif /* FLOW_CONTROL */
  },
  /* Region 3: Allows non secure access to RSS lib descriptors */
  {
    3,
    STM32_DESCRIPTOR_BASE_NS,
    STM32_DESCRIPTOR_END_NS,
    OEMIROT_FALSE,
#ifdef FLOW_CONTROL
    FLOW_STEP_SAU_I_EN_R3,
    FLOW_CTRL_SAU_I_EN_R3,
    FLOW_STEP_SAU_I_CH_R3,
    FLOW_CTRL_SAU_I_CH_R3,
#endif /* FLOW_CONTROL */
  },
};

/**
  * @}
  */
/* Private function prototypes -----------------------------------------------*/
/** @defgroup OEMIROT_SECURITY_Private_Functions  Private Functions
  * @{
  */
#ifdef OEMIROT_OB_RDP_LEVEL_VALUE
static void rdp_level(uint32_t rdplevel, uint32_t current_rdplevel);
#endif /* OEMIROT_OB_RDP_LEVEL_VALUE */
static void gtzc_init_cfg(void);
static void sau_and_idau_cfg(void);
static void mpu_init_cfg(void);
static void mpu_appli_cfg(void);
static void flash_priv_cfg(void);
static void active_tamper(void);
/**
  * @}
  */

/** @defgroup OEMIROT_SECURITY_Exported_Functions Exported Functions
  * @{
  */
/**
  * @brief  Apply the runtime security  protections to
  *
  * @param  None
  * @note   By default, the best security protections are applied
  * @retval None
  */
void LL_SECU_ApplyRunTimeProtections(void)
{
  /* Unsecure bottom of SRAM1 for error_handler */
  gtzc_init_cfg();

  /* Set MPU to forbidd execution outside of not muteable code  */
  /* Initialize not secure MPU to forbidd execution on Flash /SRAM */
  mpu_init_cfg();

  /* Enable SAU to gain access to flash area non secure for write/read */
  sau_and_idau_cfg();
  /* With OEMIROT_DEV_MODE , active tamper calls Error_Handler */
  /* Error_Handler requires sau_and_idau_cfg */
  active_tamper();

  /* Configure Flash Privilege access */
  flash_priv_cfg();
}

/**
  * @brief  Update the runtime security protections for application start
  *
  * @param  None
  * @retval None
  */
void LL_SECU_UpdateRunTimeProtections(void)
{
  /* Set MPU to enable execution of Secure and Non Secure active slots */
  mpu_appli_cfg();
}

/**
  * @brief  Check if the Static security  protections to
  *         all the Sections in Flash:  WRP, SECURE FLASH, SECURE USER FLASH.
  *         those protections not impacted by a Reset. They are set using the Option Bytes
  *         When the device is locked (RDP Level2), these protections cannot be changed anymore
  * @param  None
  * @note   By default, the best security protections are applied to the different
  *         flash sections in order to maximize the security level for the specific MCU.
  * @retval None
  */
void LL_SECU_CheckStaticProtections(void)
{
  static FLASH_OBProgramInitTypeDef flash_option_bytes_bank1 = {0};
  static FLASH_OBProgramInitTypeDef flash_option_bytes_bank2 = {0};

  /* Get bank1 areaA OB  */
  flash_option_bytes_bank1.WRPArea = OB_WRPAREA_BANK1_AREAA;
  flash_option_bytes_bank1.WMSecConfig = OB_WMSEC_AREA1;
  flash_option_bytes_bank1.BootAddrConfig = OB_BOOTADDR_SEC0;
  HAL_FLASHEx_OBGetConfig(&flash_option_bytes_bank1);
  /* Get bank2 areaB OB  */
  flash_option_bytes_bank2.WRPArea = OB_WRPAREA_BANK2_AREAA;
  flash_option_bytes_bank2.WMSecConfig = OB_WMSEC_AREA2;
  HAL_FLASHEx_OBGetConfig(&flash_option_bytes_bank2);


