zuyih/STM32CubeU3/Projects/NUCLEO-U385RG-Q/Applications/ROT/OEMiROT_Boot/Src/low_level_security.c
static void mpu_appli_cfg(void)
{
#ifdef OEMIROT_BOOT_MPU_PROTECTION
  static struct mpu_armv8m_dev_t dev_mpu_s = { MPU_BASE };
  int32_t i;

  /* configuration stage */
  if (uFlowStage == FLOW_STAGE_CFG)
  {
    /* configure secure MPU regions */
    for (i = 0; i < ARRAY_SIZE(region_cfg_appli_s); i++)
    {
      if (mpu_armv8m_region_enable(&dev_mpu_s,
                                   (struct mpu_armv8m_region_cfg_t *)&region_cfg_appli_s[i]) != MPU_ARMV8M_OK)
      {
        Error_Handler();
      }
      else
      {
        /* Execution stopped if flow control failed */
        FLOW_CONTROL_STEP(uFlowProtectValue, region_cfg_appli_s[i].flow_step_enable,
                          region_cfg_appli_s[i].flow_ctrl_enable);
      }
    }
  }
  else
  {
    /* check secure MPU regions */
    for (i = 0; i < ARRAY_SIZE(region_cfg_appli_s); i++)
    {
      if (mpu_armv8m_region_enable_check(&dev_mpu_s,
                                         (struct mpu_armv8m_region_cfg_t *)&region_cfg_appli_s[i]) != MPU_ARMV8M_OK)
      {
        Error_Handler();
      }
      else
      {
        /* Execution stopped if flow control failed */
        FLOW_CONTROL_STEP(uFlowProtectValue, region_cfg_appli_s[i].flow_step_check,
                          region_cfg_appli_s[i].flow_ctrl_check);
      }
    }
  }
#endif /* OEMIROT_BOOT_MPU_PROTECTION */
}

/**
  * @brief  configure flash privilege access
  * @param  None
  * @retval None
  */
static void flash_priv_cfg(void)
{
#ifdef OEMIROT_FLASH_PRIVONLY_ENABLE
  /* configuration stage */
  if (uFlowStage == FLOW_STAGE_CFG)
  {
    /* Configure Flash Privilege access */
    HAL_FLASHEx_ConfigPrivMode(FLASH_SPRIV_DENIED);
    /* Execution stopped if flow control failed */
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_FLASH_P_EN, FLOW_CTRL_FLASH_P_EN);
  }
  /* verification stage */
  else
  {
    if (HAL_FLASHEx_GetPrivMode() != FLASH_SPRIV_DENIED)
    {
      Error_Handler();
    }
    else
    {
      /* Execution stopped if flow control failed */
      FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_FLASH_P_CH, FLOW_CTRL_FLASH_P_CH);
    }
  }
#endif /*  OEMIROT_FLASH_PRIVONLY_ENABLE */
}

#if (OEMIROT_TAMPER_ENABLE != NO_TAMPER)
const RTC_SecureStateTypeDef TamperSecureConf =
{
  .rtcSecureFull = RTC_SECURE_FULL_NO,
  .rtcNonSecureFeatures = RTC_NONSECURE_FEATURE_ALL,
  .tampSecureFull = TAMP_SECURE_FULL_YES,
  .MonotonicCounterSecure = TAMP_MONOTONIC_CNT_SECURE_NO,
  .backupRegisterStartZone2 = 0,
  .backupRegisterStartZone3 = 0
};
const RTC_PrivilegeStateTypeDef TamperPrivConf =
{
  .rtcPrivilegeFull = RTC_PRIVILEGE_FULL_NO,
  .rtcPrivilegeFeatures = RTC_PRIVILEGE_FEATURE_NONE,
  .tampPrivilegeFull = TAMP_PRIVILEGE_FULL_YES,
  .MonotonicCounterPrivilege = TAMP_MONOTONIC_CNT_PRIVILEGE_NO,
  .backupRegisterStartZone2 = 0,
  .backupRegisterStartZone3 = 0
};
const RTC_InternalTamperTypeDef InternalTamperConf =
{
  .IntTamper = RTC_INT_TAMPER_9,   /* Cryptographic peripherals fault */
  .TimeStampOnTamperDetection = RTC_TIMESTAMPONTAMPERDETECTION_DISABLE,
  .NoErase                    = RTC_TAMPER_ERASE_BACKUP_ENABLE
};

void TAMP_IRQHandler(void)
{
  NVIC_SystemReset();
}

#ifdef OEMIROT_DEV_MODE
extern volatile uint32_t TamperEventCleared;
#endif
#endif /* (OEMIROT_TAMPER_ENABLE != NO_TAMPER) */
RTC_HandleTypeDef RTCHandle;

static void active_tamper(void)
{
#if (OEMIROT_TAMPER_ENABLE == ALL_TAMPER)
  RTC_TamperTypeDef sTamper = {0};
#endif /* (OEMIROT_TAMPER_ENABLE == ALL_TAMPER) */
#if (OEMIROT_TAMPER_ENABLE != NO_TAMPER)
  RTC_SecureStateTypeDef TamperSecureConfGet;
  RTC_PrivilegeStateTypeDef TamperPrivConfGet;
  uint32_t DeviceSecretConf;
#endif /* OEMIROT_TAMPER_ENABLE != NO_TAMPER) */
  /* configuration stage */
  if (uFlowStage == FLOW_STAGE_CFG)
  {
#if defined(OEMIROT_DEV_MODE) && (OEMIROT_TAMPER_ENABLE != NO_TAMPER)
    if (TamperEventCleared)
    {
      BOOT_LOG_INF("Boot with TAMPER Event Active");
      BOOT_LOG_INF("Build and Flash with flag #define OEMIROT_TAMPER_ENABLE NO_TAMPER\n");
      Error_Handler();
    }
#endif /*  OEMIROT_DEV_MODE && (OEMIROT_TAMPER_ENABLE != NO_TAMPER) */

    /* RTC Init */
    RTCHandle.Instance = RTC;
    RTCHandle.Init.HourFormat     = RTC_HOURFORMAT_12;
    RTCHandle.Init.AsynchPrediv   = RTC_ASYNCH_PREDIV;
    RTCHandle.Init.SynchPrediv    = RTC_SYNCH_PREDIV;
    RTCHandle.Init.OutPut         = RTC_OUTPUT_DISABLE;
    RTCHandle.Init.OutPutRemap    = RTC_OUTPUT_REMAP_NONE;
    RTCHandle.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
    RTCHandle.Init.OutPutType     = RTC_OUTPUT_TYPE_PUSHPULL;
    RTCHandle.Init.OutPutPullUp   = RTC_OUTPUT_PULLUP_NONE;

    if (HAL_RTC_Init(&RTCHandle) != HAL_OK)
    {
      Error_Handler();
    }
#if (OEMIROT_TAMPER_ENABLE == ALL_TAMPER)
    /** Enable the RTC Tamper 1 */
    sTamper.Tamper = RTC_TAMPER_1;
    sTamper.Trigger = RTC_TAMPERTRIGGER_LOWLEVEL;
    sTamper.NoErase = RTC_TAMPER_ERASE_BACKUP_ENABLE;
    sTamper.MaskFlag = RTC_TAMPERMASK_FLAG_DISABLE;
    sTamper.Filter = RTC_TAMPERFILTER_DISABLE;
    sTamper.SamplingFrequency = RTC_TAMPERSAMPLINGFREQ_RTCCLK_DIV32768;
    sTamper.PrechargeDuration = RTC_TAMPERPRECHARGEDURATION_1RTCCLK;
    sTamper.TamperPullUp = RTC_TAMPER_PULLUP_ENABLE;
    if (HAL_RTCEx_SetTamper(&RTCHandle, &sTamper) != HAL_OK)
    {
      Error_Handler();
    }
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_ACT_EN, FLOW_CTRL_TAMP_ACT_EN);
#else
    HAL_RTCEx_DeactivateTamper(&RTCHandle, RTC_TAMPER_ALL);
#endif  /* (OEMIROT_TAMPER_ENABLE == ALL_TAMPER) */
#if (OEMIROT_TAMPER_ENABLE != NO_TAMPER)
    /*  Internal Tamper activation  */
    /*  Enable Cryptographic IPs fault (tamp_itamp9), Backup domain voltage threshold monitoring (tamp_itamp1)*/
    if (HAL_RTCEx_SetInternalTamper(&RTCHandle, (RTC_InternalTamperTypeDef *)&InternalTamperConf) != HAL_OK)
    {
      Error_Handler();
    }
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_INT_EN, FLOW_CTRL_TAMP_INT_EN);

    /*  Set tamper configuration secure only  */
    if (HAL_RTCEx_SecureModeSet(&RTCHandle, (RTC_SecureStateTypeDef *)&TamperSecureConf) != HAL_OK)
    {
      Error_Handler();
    }
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_SEC_EN, FLOW_CTRL_TAMP_SEC_EN);

