zuyih/STM32CubeU3/Projects/NUCLEO-U385RG-Q/Applications/ROT/OEMiROT_Boot/Src/low_level_security.c
    /*  Set tamper configuration privileged only   */
    if (HAL_RTCEx_PrivilegeModeSet(&RTCHandle, (RTC_PrivilegeStateTypeDef *)&TamperPrivConf) != HAL_OK)
    {
      Error_Handler();
    }
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_PRIV_EN, FLOW_CTRL_TAMP_PRIV_EN);

    /*  Activate Secret Erase */
    DeviceSecretConf = (uint32_t)TAMP_DEVICESECRETS_ERASE_SRAM2 | TAMP_DEVICESECRETS_ERASE_CRYPTO | TAMP_DEVICESECRETS_ERASE_ICACHE |
                       TAMP_DEVICESECRETS_ERASE_HASH | TAMP_DEVICESECRETS_ERASE_PKA_SRAM;
    HAL_RTCEx_ConfigEraseDeviceSecrets(&RTCHandle, DeviceSecretConf);

    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_CFG_EN, FLOW_CTRL_TAMP_CFG_EN);
    BOOT_LOG_INF("TAMPER Activated");
#else
    HAL_RTCEx_DeactivateInternalTamper(&RTCHandle, RTC_INT_TAMPER_ALL);
#endif /* (OEMIROT_TAMPER_ENABLE != NO_TAMPER) */
  }
#if (OEMIROT_TAMPER_ENABLE != NO_TAMPER)
  /* verification stage */
  else
  {
    fih_int fih_rc = FIH_FAILURE;
#if (OEMIROT_TAMPER_ENABLE == ALL_TAMPER)
    /*  Check External Tamper activation */
    if ((READ_REG(TAMP->CR1) & TAMP_CR1_TAMP1E_Msk)   != TAMP_CR1_TAMP1E)
    {
      Error_Handler();
    }
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_ACT_CH, FLOW_CTRL_TAMP_ACT_CH);
#endif  /* (OEMIROT_TAMPER_ENABLE == ALL_TAMPER) */
    /*  Check Internal Tamper activation */
    if ((READ_BIT(RTC->CR, RTC_CR_TAMPTS) != InternalTamperConf.TimeStampOnTamperDetection) ||
#if (OEMIROT_TAMPER_ENABLE == ALL_TAMPER)
        (READ_REG(TAMP->CR1) != (TAMP_CR1_ITAMP9E | TAMP_CR1_TAMP1E)) ||
#else
        (READ_REG(TAMP->CR1) != (TAMP_CR1_ITAMP9E)) ||
#endif
        (READ_REG(TAMP->CR3) != 0x00000000U))
    {
      Error_Handler();
    }
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_INT_CH, FLOW_CTRL_TAMP_INT_CH);

    /*  Check tamper configuration secure only  */
    if (HAL_RTCEx_SecureModeGet(&RTCHandle, (RTC_SecureStateTypeDef *)&TamperSecureConfGet) != HAL_OK)
    {
      Error_Handler();
    }
    FIH_CALL(boot_fih_memequal, fih_rc, (void *)&TamperSecureConf, (void *)&TamperSecureConfGet, sizeof(TamperSecureConf));
    if (fih_not_eq(fih_rc, FIH_SUCCESS))
    {
      Error_Handler();
    }
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_SEC_CH, FLOW_CTRL_TAMP_SEC_CH);

    /*  Check tamper configuration privileged only   */
    if (HAL_RTCEx_PrivilegeModeGet(&RTCHandle, (RTC_PrivilegeStateTypeDef *)&TamperPrivConfGet) != HAL_OK)
    {
      Error_Handler();
    }
    FIH_CALL(boot_fih_memequal, fih_rc, (void *)&TamperPrivConf, (void *)&TamperPrivConfGet, sizeof(TamperPrivConf));
    if (fih_not_eq(fih_rc, FIH_SUCCESS))
    {
      Error_Handler();
    }
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_PRIV_CH, FLOW_CTRL_TAMP_PRIV_CH);

    /*  Check Secret Erase */
    DeviceSecretConf = (uint32_t)TAMP_DEVICESECRETS_ERASE_SRAM2 | TAMP_DEVICESECRETS_ERASE_CRYPTO | TAMP_DEVICESECRETS_ERASE_ICACHE |
                       TAMP_DEVICESECRETS_ERASE_HASH | TAMP_DEVICESECRETS_ERASE_PKA_SRAM;

    if (READ_REG(TAMP->RPCFGR) != DeviceSecretConf)
    {
      Error_Handler();
    }
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_CFG_CH, FLOW_CTRL_TAMP_CFG_CH);
  }
#endif /*  OEMIROT_TAMPER_ENABLE != NO_TAMPER */
}
/**
  * @}
  */
